  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-nat-gw` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/b50241d2-c30c-49da-b45c-6f5fb64d7a0f/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway will be created
+ resource "azurerm_nat_gateway" "nat_gateway" {
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + location                = "eastus"
    + name                    = "my-secure-nat-gw"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + resource_guid           = (known after apply)
    + sku_name                = "Standard"
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"] will be created
+ resource "azurerm_nat_gateway_public_ip_association" "association" {
    + id                   = (known after apply)
    + nat_gateway_id       = (known after apply)
    + public_ip_address_id = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-nat-gw-public-ip-1"
  }

Plan: 2 to add, 0 to change, 0 to destroy.
module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway: Creating...
module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway: Still creating... [10s elapsed]
module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway: Creation complete after 13s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/natGateways/my-secure-nat-gw]
module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"]: Creating...
module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"]: Still creating... [10s elapsed]
module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"]: Creation complete after 13s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/natGateways/my-secure-nat-gw|/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-nat-gw-public-ip-1]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

  </details>